"""
////////////////////////////////////////////////////////////////////////////////////////////
За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m//
километров? При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.//
////////////////////////////////////////////////////////////////////////////////////////////,
"""

print ("Сколько проезжает машина за день?: ")
n = int(input())
print ("Какова длинна маршрута?: ")
m = int(input())

print ("Проедем маршрут за {} дней.".format((m+n-1)//n))
